Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CZ-CA90_DFP/1.0.18/CA90/svd/PIC32CZ4010CA90144.svd
               <register>
                  <name>PHY20</name>
                  <description>USBHPHY Control Register.</description>
                  <addressOffset>0x1520</addressOffset>
                  <size>32</size>
                  <resetValue>0x00000080</resetValue>
                  <fields>
                     <field>
                        <name>RSVD</name>
                        <bitOffset>0</bitOffset>
                        <bitWidth>4</bitWidth>
                     </field>
                     <field>
                        <name>HSSLEW10</name>
                        <description>Lower 2 bits for HS slew adjust rate</description>
                        <bitOffset>6</bitOffset>
                        <bitWidth>2</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>PHY24</name>
                  <description>USBHPHY Control Register.</description>
                  <addressOffset>0x1524</addressOffset>
                  <size>32</size>
                  <resetValue>0x0000000C</resetValue>
                  <fields>
                     <field>
                        <name>HSSLEW2</name>
                        <description>MSB of HS slew rate adjust</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>RSVD</name>
                        <bitOffset>2</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>HSPREEMPST</name>
                        <description>HS transmit pre emphasis strength</description>
                        <bitOffset>3</bitOffset>
                        <bitWidth>3</bitWidth>
                     </field>
                     <field>
                        <name>HSDRIVST10</name>
                        <description>HS transmit drive strength</description>
                        <bitOffset>6</bitOffset>
                        <bitWidth>2</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>PHY28</name>
                  <description>USBHPHY Control Register.</description>
                  <addressOffset>0x1528</addressOffset>
                  <size>32</size>
                  <resetValue>0x0000001B</resetValue>
                  <fields>
                     <field>
                        <name>HSDRIVST2</name>
                        <description>MSB of HS transmit driver strength</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>DISCONDET</name>
                        <description>HOST disconnects detection trigger point</description>
                        <bitOffset>1</bitOffset>
                        <bitWidth>4</bitWidth>
                     </field>
                     <field>
                        <name>HSDRVCOMP</name>
                        <description>HS drive current compensation voltage reference</description>
                        <bitOffset>5</bitOffset>
                        <bitWidth>3</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>PHY44</name>
                  <description>USBHPHY Control Register.</description>
                  <addressOffset>0x1544</addressOffset>
                  <size>32</size>
                  <resetValue>0x00000040</resetValue>
                  <fields>
                     <field>
                        <name>PLLDAMP</name>
                        <description>PLL damping factor</description>
                        <bitOffset>1</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>DIGDBG</name>
                        <description>Digital debug interface</description>
                        <bitOffset>2</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>FRCVBUSVAL</name>
                        <description>Force output vbus_valid</description>
                        <bitOffset>3</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>RSVD</name>
                        <bitOffset>4</bitOffset>
                        <bitWidth>3</bitWidth>
                     </field>
                     <field>
                        <name>FRCSESSEND</name>
                        <description>force session end</description>
                        <bitOffset>7</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>PHY48</name>
                  <description>USBHPHY Control Register.</description>
                  <addressOffset>0x1548</addressOffset>
                  <size>32</size>
                  <resetValue>0x00000004</resetValue>
                  <fields>
                     <field>
                        <name>FRCASESSVAL</name>
                        <description>force A_sessionvalid</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>FRCBSESSVAL</name>
                        <description>force B_sessionvalid</description>
                        <bitOffset>1</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>VBUSCHRGE</name>
                        <description>VBus charging/discharging bypass</description>
                        <bitOffset>2</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>SESSENDTUNE</name>
                        <description>Session end reference tuning</description>
                        <bitOffset>5</bitOffset>
                        <bitWidth>3</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>PHY4C</name>
                  <description>USBHPHY Control Register.</description>
                  <addressOffset>0x154C</addressOffset>
                  <size>32</size>
                  <resetValue>0x00000000</resetValue>
                  <fields>
                     <field>
                        <name>VBUSVALTUNE</name>
                        <description>VBus_valid reference tuning</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>3</bitWidth>
                     </field>
                     <field>
                        <name>BSESSVALIDTUNE10</name>
                        <description>Lower 2 B_sessionvalid reference tune</description>
                        <bitOffset>6</bitOffset>
                        <bitWidth>2</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>PHY50</name>
                  <description>USBHPHY Control Register.</description>
                  <addressOffset>0x1550</addressOffset>
                  <size>32</size>
                  <resetValue>0x00000000</resetValue>
                  <fields>
                     <field>
                        <name>BSESSVALIDTUNE2</name>
                        <description>MSB of B_sessionvalid reference tune</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>ASESSVALIDTUNE</name>
                        <description>A_sessionvalid reference tune</description>
                        <bitOffset>1</bitOffset>
                        <bitWidth>3</bitWidth>
                     </field>
                     <field>
                        <name>COMPCURREF</name>
                        <description>Compensation current tuning reference</description>
                        <bitOffset>5</bitOffset>
                        <bitWidth>3</bitWidth>
                     </field>
                  </fields>
               </register>
            </cluster>
